In [3]:
# List of high schools

In [4]:
high_schools = ["Hernandez High School", "Figueroa High School", "Wilson High School", "Wright High School"]

In [5]:
for school in high_schools:
    print(school)

Hernandez High School
Figueroa High School
Wilson High School
Wright High School

In [6]:
# A dictionary of high schools and the type of school.
high_school_types = [{"High School": "Griffin", "Type":"District"},
                    {"High School": "Figueroa", "Type": "District"},
                    {"High School": "Wilson", "Type": "Charter"},
                    {"High School": "Wright", "Type": "Charter"}]

In [7]:
for school in high_school_types:
    print(school)

{'High School': 'Griffin', 'Type': 'District'}
{'High School': 'Figueroa', 'Type': 'District'}
{'High School': 'Wilson', 'Type': 'Charter'}
{'High School': 'Wright', 'Type': 'Charter'}

In [8]:
# List of high schools
high_schools = ["Huang High School",  "Figueroa High School", "Shelton High School", "Hernandez High School","Griffin High School","Wilson High School", "Cabrera High School", "Bailey High School", "Holden High School", "Pena High School", "Wright High School","Rodriguez High School", "Johnson High School", "Ford High School", "Thomas High School"]

In [9]:
# Add the Pandas dependency.
import pandas as pd

In [10]:
# Create a Pandas Series from a list.
school_series = pd.Series(high_schools)

In [11]:
# Create a Pandas Series from a list.
school_series = pd.Series(high_schools)
school_series

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
dtype: object

In [12]:
for school in school_series:
    print(school        )

Huang High School
Figueroa High School
Shelton High School
Hernandez High School
Griffin High School
Wilson High School
Cabrera High School
Bailey High School
Holden High School
Pena High School
Wright High School
Rodriguez High School
Johnson High School
Ford High School
Thomas High School

In [13]:
# A dictionary of high schools
high_school_dicts = [{"School ID": 0, "school_name": "Huang High    School", "type": "District"},
                   {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [15]:
school_df = pd.DataFrame(high_school_dicts)
school_df

   School ID            school_name      type
0          0   Huang High    School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [16]:
# getting column 
school_df.columns

Index(['School ID', 'school_name', 'type'], dtype='object')

In [17]:
# Three separate lists of information on high schools
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

In [18]:
# Initialize a new DataFrame.
schools_df = pd.DataFrame()

In [19]:
# Add the list to a new DataFrame.
schools_df["School ID"] = school_id

# Print the DataFrame.
schools_df

   School ID
0          0
1          1
2          2
3          3
4          4

In [71]:
# getting column 
school_df.columns

Index(['School ID', 'school_name', 'type'], dtype='object')

In [ ]:
# Add the school_name list as "School Name" and the type_of_school list as "Type" to the schools_df DataFrame. 
# This is below

In [77]:
# Create a dictionary of information on high schools.
high_schools_dict = {'School ID': school_id, 'school_name':school_name, 'type':type_of_school}

In [78]:
school_df = pd.DataFrame(high_school_dicts)
school_df

   School ID            school_name      type
0          0   Huang High    School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [79]:
school_df.columns

Index(['School ID', 'school_name', 'type'], dtype='object')

In [80]:
school_df.index

RangeIndex(start=0, stop=5, step=1)

In [20]:
school_df.values

array([[0, 'Huang High    School', 'District'],
       [1, 'Figueroa High School', 'District'],
       [2, 'Shelton High School', 'Charter'],
       [3, 'Hernandez High School', 'District'],
       [4, 'Griffin High School', 'Charter']], dtype=object)

In [24]:
# Skill Drill Based on the following image, create a list for each column and add each list to a new Pandas DataFrame
# To Do

In [ ]:
# Reorder the columns in the order you want them to appear. From Module 4.7.9
#     new_column_order = ["column2", "column4", "column1"]

# Assign a new or the same DataFrame the new column order.
#     df = df[new_column_order]

In [ ]:
# Reorder the columns in the order you want them to appear. From Module 4.7.9
#    new_column_order = ["Total Schools", "Total Students", "Total Budget","Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading", "% Overall Passing"]

# Assign district summary df the new column order.
#    district_summary_df = district_summary_df[new_column_order]
#    district_summary_df

In [ ]:
# Reorder the columns in the order you want them to appear.
#new_column_order = ["School Type", "Total Students", "Total School Budget", "Per Student Budget", "Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading", "% Overall Passing"]

# Assign district summary df the new column order.
#per_school_summary_df = per_school_summary_df[new_column_order]

#per_school_summary_df.head()

In [25]:
# Object Oriented Programming

In [26]:
class Cat:
    def __init__(self, name):
        self.name = name

In [27]:
first_cat = Cat('Felix')
print(first_cat.name)

Felix

In [28]:
second_cat = Cat('Garfield')
print(second_cat.name)

Garfield

In [29]:
class Dog:
    def __init__(self, name, color, sound):
        self.name = name
        self.color = color
        self.sound = sound

    def bark(self):
        return self.sound + ' ' + self.sound

In [30]:
first_dog = Dog('Fido', 'brown', 'woof!')
print(    first_dog.name)
print(first_dog.color)
first_dog.bark()

Fido
brown

'woof! woof!'

In [31]:
second_dog = Dog('Lady', 'blonde', 'arf!')
print(    second_dog.name)
print(second_dog.color)
second_dog.bark()

Lady
blonde

'arf! arf!'

In [4]:
# Import required libraries
import pandas as pd
import numpy as np

# Dictionary
df1 = {
	'Name': ['abc', 'bcd', 'cde',
			'def', 'efg', 'fgh',
			'ghi'],
	'Math_score': [52, 87, 49,
				74, 28, 59,
				48]}

# Create a DataFrame
df1 = pd.DataFrame(df1,
				columns = ['Name',
							'Math_score'])

# Calculating Percentage
df1['percent'] = (df1['Math_score'] /
				df1['Math_score'].sum()) * 100

# Show the dataframe
df1

  Name  Math_score    percent
0  abc          52  13.098237
1  bcd          87  21.914358
2  cde          49  12.342569
3  def          74  18.639798
4  efg          28   7.052897
5  fgh          59  14.861461
6  ghi          48  12.090680

In [8]:
# import pandas as pd
import pandas as pd
 
# list of strings
lst = ['Geeks', 'For', 'Geeks', 'is', 
            'portal', 'for', 'Geeks']
 
# Calling DataFrame constructor on list
df = pd.DataFrame(lst)
print(df)

        0
0   Geeks
1     For
2   Geeks
3      is
4  portal
5     for
6   Geeks